export const Color = (color: string) => `var(--mantine-color-${color})`;
export const ImageFallback = "https://www.semfed.org.uk/wp-content/themes/artpop/assets/images/fallback-image.png"
export const ProductCategory = [
    "Основные материалы",
    "Фурнитура",
    "Уплотнители и герметики",
    "Дополнительные элементы"
]
export const ApplicationStatus = {
    'Not accepted': 'В рассмотрении',
    'Accepted': 'Принято',
    "Done": "Завершено"
}
export const WorkerRoles = ['Менеджер', 'Мастер']
export const monthTranslations = {
    January: "Январь",
    February: "Февраль",
    March: "Март",
    April: "Апрель",
    May: "Май",
    June: "Июнь",
    July: "Июль",
    August: "Август",
    September: "Сентябрь",
    October: "Октябрь",
    November: "Ноябрь",
    December: "Декабрь",
};

export const windows = {
    artec: {
        name: "ARTEC",
        url: "/windows/artec-mobile.png",
        highlights: [
            "Стекло толщиной 4 мм возможно заказать со стеклом толщиной 6 мм.",
            "Стеклопакет толщиной до 36 мм Двухкамерный теплопакет класса 4+ к каждому окну в подарок.",
            "Пятикамерный профиль шириной 70 мм эконом класса имеет широкую облась применения для любых типов домов. ",
            "Уплотнительный контур обеспечивает защиту от проникновения влаги и пыли в помещение, доступен в трех вариантах цвета: черном, светло-сером и белом.",
            "Стальное замкнутое армирование придает упругость и прочность оконному ПВХ профилю.",
        ],
        price: "15502 ₸/м2",
        desc: "Компания АRтеc позиционируют особое преимущество своих профилей в многоуровневом контроле над качеством в процессе производства. Внедрение прогрессивных технологий позволило получить на выходе безупречные окна премиум-класса с высокими потребительскими характеристиками. Сегодня окна АRтеc являются лидерами продаж на отечественном рынке пластиковых оконных модулей. Немецкие производители данного профиля традиционно радуют потребителя высоким уровнем исполнения, комфортной практичностью и непревзойдённо долгим сроком службы. Профиль Артек отлично зарекомендовал себя на нашем рынке, что подтверждается многочисленными отзывами потребителей. Приобретая данный продукт, Вы в скором времени сможете на практике оценить следующие приоритеты, которые предоставляют в распоряжение владельцев эти функциональные архитектурные элементы.",
        colors: [
            { url: "https://zok.kz/img/Galwin/lam1.jpg", name: "Махагон" },
            { url: "https://zok.kz/img/Galwin/lam2.jpg", name: "Дуб" },
            { url: "https://zok.kz/img/Galwin/lam3.jpg", name: "Орегон" },
            { url: "https://zok.kz/img/Galwin/lam4.jpg", name: "Светлый дуб" },
        ],
        stats: [
            { label: "Теплоизоляция", value: 16 },
            { label: "Шумоизоляция	", value: 15 },
            { label: "Дизайн", value: 16 },
        ]
    },
    exprof58: {
        name: "Exprof 58",
        url: "/windows/exprof58.png",
        highlights: [
            "Стекло толщиной 4 мм возможно заказать со стеклом толщиной 6 мм.",
            "Стеклопакет толщиной до 32 мм",
            "Четырехкамерный профиль шириной 58 мм Широкий 4-камерный профиль позволяет установить более толстый стеклопакет, что значительно увеличивает теплоизоляцию помещения.",
            "Уплотнительный контур обеспечивает защиту от проникновения влаги и пыли в помещение, доступен в трех вариантах цвета: черном, светло-сером и белом.",
            "Стальное замкнутое армирование придает упругость и прочность оконному ПВХ профилю.",
        ],
        price: "13952 ₸/м2",
        desc: " Окна Exprof, благодаря великолепным потребительским характеристикам и продолжительному сроку безотказной эксплуатации, в настоящее время занимают верхние позиции в рейтинге лучших оконных систем. Пластиковые окна Exprof изготавливаются на дочерних предприятиях немецкого химического концерна «HT Troplast AG» на основе инновационных технологий производства стеклопакетов из ПВХ премиум-класса. Достижения бренда Exprof вот уже не один год позволяют этой торговой марке находиться на пике покупательского спроса, который постоянно стимулируется новыми привлекательными разработками в более высоком формате качества. Пластиковые окна Exprof постоянно устанавливают новые стандарты в области изготовления оконных систем повышенной комфортности, и миллионы покупателей уже оценили все очевидные преимущества этой популярной торговой марки. ",
        colors: [
            { url: "https://zok.kz/img/Galwin/lam1.jpg", name: "Махагон" },
            { url: "https://zok.kz/img/Galwin/lam2.jpg", name: "Дуб" },
            { url: "https://zok.kz/img/Galwin/lam3.jpg", name: "Орегон" },
            { url: "https://zok.kz/img/Galwin/lam4.jpg", name: "Светлый дуб" },
        ],
        stats: [
            { label: "Теплоизоляция", value: 15 },
            { label: "Шумоизоляция	", value: 14 },
            { label: "Дизайн", value: 15 },
        ]
    },
    exprof70: {
        name: "Exprof 70",
        url: "/windows/exprof70.png",
        highlights: ["Стекло толщиной 4 мм возможно заказать со стеклом толщиной 6 мм.", "Стеклопакет толщиной до 42 мм Морозостойкость - до -60°С.", "Пятикамерный профиль шириной 70 мм Исключительная герметичность и возможность создания индивидуальных дизайнерских решений в сочетании с повышенными теплоизоляционными качествами.", "Уплотнительный контур обеспечивает защиту от проникновения влаги и пыли в помещение, доступен в трех вариантах цвета: черном, светло-сером и белом.", "Стальное замкнутое армирование придает упругость и прочность оконному ПВХ профилю."],
        price: "15812 ₸/м2",
        desc: "Окна Exprof, благодаря великолепным потребительским характеристикам и продолжительному сроку безотказной эксплуатации, в настоящее время занимают верхние позиции в рейтинге лучших оконных систем. Пластиковые окна Exprof изготавливаются на дочерних предприятиях немецкого химического концерна «HT Troplast AG» на основе инновационных технологий производства стеклопакетов из ПВХ премиум-класса. Достижения бренда Exprof вот уже не один год позволяют этой торговой марке находиться на пике покупательского спроса, который постоянно стимулируется новыми привлекательными разработками в более высоком формате качества. Пластиковые окна Exprof постоянно устанавливают новые стандарты в области изготовления оконных систем повышенной комфортности, и миллионы покупателей уже оценили все очевидные преимущества этой популярной торговой марки.",
        colors: [
            { url: "https://zok.kz/img/Galwin/lam1.jpg", name: "Махагон" },
            { url: "https://zok.kz/img/Galwin/lam2.jpg", name: "Дуб" },
            { url: "https://zok.kz/img/Galwin/lam3.jpg", name: "Орегон" },
            { url: "https://zok.kz/img/Galwin/lam4.jpg", name: "Светлый дуб" },
        ],

        stats: [
            { label: "Теплоизоляция", value: 17 },
            { label: "Шумоизоляция	", value: 16 },
            { label: "Дизайн", value: 17 },
        ]
    },
    exprof101: {
        name: "Exprof 101",
        url: "/windows/exprof101.png",
        highlights: ["Стекло толщиной 4 мм возможно заказать со стеклом толщиной 6 мм.", "Стеклопакет толщиной до 52 мм Морозостойкость - до -60°С.", "Шестикамерный профиль шириной 101 мм Элегантный внешний вид и высокая функциональность, обеспечивают высочайший комфорт при максимальной экономичности, теплоизоляции и экологичности.", "Уплотнительный контур обеспечивает защиту от проникновения влаги и пыли в помещение, доступен в трех вариантах цвета: черном, светло-сером и белом.", "Стальное замкнутое армирование придает упругость и прочность оконному ПВХ профилю."],
        price: "17784 ₸/м2",
        desc: "Окна Exprof, благодаря великолепным потребительским характеристикам и продолжительному сроку безотказной эксплуатации, в настоящее время занимают верхние позиции в рейтинге лучших оконных систем. Пластиковые окна Exprof изготавливаются на дочерних предприятиях немецкого химического концерна «HT Troplast AG» на основе инновационных технологий производства стеклопакетов из ПВХ премиум-класса. Достижения бренда Exprof вот уже не один год позволяют этой торговой марке находиться на пике покупательского спроса, который постоянно стимулируется новыми привлекательными разработками в более высоком формате качества. Пластиковые окна Exprof постоянно устанавливают новые стандарты в области изготовления оконных систем повышенной комфортности, и миллионы покупателей уже оценили все очевидные преимущества этой популярной торговой марки.",
        colors: [
            { url: "https://zok.kz/img/Galwin/lam1.jpg", name: "Махагон" },
            { url: "https://zok.kz/img/Galwin/lam2.jpg", name: "Дуб" },
            { url: "https://zok.kz/img/Galwin/lam3.jpg", name: "Орегон" },
            { url: "https://zok.kz/img/Galwin/lam4.jpg", name: "Светлый дуб" },
        ],

        stats: [
            { label: "Теплоизоляция", value: 18 },
            { label: "Шумоизоляция	", value: 18 },
            { label: "Дизайн", value: 18 },
        ]

    },
    galwin58: {
        name: "Galwin 58",
        url: "/windows/galwin58.png",
        highlights: ["Стекло толщиной 4 мм возможно заказать со стеклом толщиной 6 мм.", "Стеклопакет толщиной до 32 мм теплопакет класса 4+ в подарок.", "Трехкамерный профиль шириной 58 мм эконом класса имеет широкую облась применения для любых типов домов.", "Уплотнительный контур обеспечивает защиту от проникновения влаги и пыли в помещение, Цвет уплотнителя: черный", "Армированный профиль обеспечивает надежность и защиту от просадок."],
        price: "12548 ₸/м2",
        desc: "",
        colors: [
            { url: "https://zok.kz/img/Galwin/lam1.jpg", name: "Махагон" },
            { url: "https://zok.kz/img/Galwin/lam2.jpg", name: "Дуб" },
            { url: "https://zok.kz/img/Galwin/lam3.jpg", name: "Орегон" },
            { url: "https://zok.kz/img/Galwin/lam4.jpg", name: "Светлый дуб" },
        ],

        stats: [
            { label: "Теплоизоляция", value: 15 },
            { label: "Шумоизоляция	", value: 14 },
            { label: "Дизайн", value: 14 },
        ]
    },
    galwin70: {
        name: "Galwin 70",
        url: "/windows/galwin70.png",
        highlights: ["Стекло толщиной 4 мм возможно заказать со стеклом толщиной 6 мм.", "Стеклопакет толщиной до 44 мм теплопакет класса 4+ в подарок.", " Четырехкамерный профиль шириной 70 мм эконом класса имеет широкую область применения для любых типов домов. ", "Уплотнительный контур обеспечивает защиту от проникновения влаги и пыли в помещение, Цвет уплотнителя: черный", "Армированный профиль обеспечивает надежность и защиту от просадок."],
        price: "12958 ₸/м2",
        desc: "",
        colors: [
            { url: "https://zok.kz/img/Galwin/lam1.jpg", name: "Махагон" },
            { url: "https://zok.kz/img/Galwin/lam2.jpg", name: "Дуб" },
            { url: "https://zok.kz/img/Galwin/lam3.jpg", name: "Орегон" },
            { url: "https://zok.kz/img/Galwin/lam4.jpg", name: "Светлый дуб" },
        ],

        stats: [
            { label: "Теплоизоляция", value: 17 },
            { label: "Шумоизоляция	", value: 17 },
            { label: "Дизайн", value: 16 },
        ]

    }

}
